app/Controllers/Dropdown.php

SELECT *
FROM `provinsi`
ORDER BY `nama_prov` ASC
---
    function index()
    {
        $provinsiModel = new ProvinsiModel();

        $data['provinsi'] = $provinsiModel->orderBy('nama_prov', 'ASC')->findAll();

SELECT *
FROM `kecamatan`
WHERE `id_kota` = '6'
---
    function action()
    {
        if($this->request->getVar('action'))
		{
			$action = $this->request->getVar('action');

			if($action == 'get_kabupaten')
			{
				$kabupatenModel = new KabupatenModel();

				$kabupatendata = $kabupatenModel->where('id_prov', $this->request->getVar('id_prov'))->findAll();

				echo json_encode($kabupatendata);
			}

			if($action == 'get_kecamatan')
			{
				$kecamatanModel = new KecamatanModel();

				$kecamatandata = $kecamatanModel->where('id_kota', $this->request->getVar('id_kota'))->findAll();